Revit 2026 API

# OrdinateTextPosition Enumeration

---

The ordinate dimension text position.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum OrdinateTextPosition
```
```vb
Public Enumeration OrdinateTextPosition
```
```cpp
public enum class OrdinateTextPosition
```
```fsharp
type OrdinateTextPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| EndOfWitnessLine | 0 | The dimension text position will be at the end of witness line. |
| NextToWitnessLine | 1 | The dimension text position will be next to witness line. |

#### Reference

Autodesk.Revit.DB Namespace